# CorrectionFactorSet Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CorrectionFactorSet Class
Members See Also
---
A set that contains correction factors.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class CorrectionFactorSet : APIObject,
	IEnumerable
```

Visual Basic
---
```text
Public Class CorrectionFactorSet _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class CorrectionFactorSet : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB.Electrical..::..CorrectionFactorSet
# See Also
CorrectionFactorSet Members
Autodesk.Revit.DB.Electrical Namespace